docs: readme updated
